# InvalidClosedLoopsForFaceSplit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FaceSplitterFailures..::..InvalidClosedLoopsForFaceSplit Property
BuiltInFailures..::..FaceSplitterFailures Class See Also
---
The closed loop used to split the face must lie completely within the face and cannot intersect or overlap any of the face's edges. To split a face at its border, use an open loop that ends on the boundary of the face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidClosedLoopsForFaceSplit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidClosedLoopsForFaceSplit As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidClosedLoopsForFaceSplit {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FaceSplitterFailures Class
Autodesk.Revit.DB Namespace